---
kind: other
id: AllMembers.T:Autodesk.Revit.Exceptions.UnauthenticatedException
source: html/9d950ed6-1b3d-4d12-628a-7885e788787b.htm
---
# UnauthenticatedException Members

Retrieves data needed to serialize the target object.